Revit 2024 API
PanelScheduleTemplate.GetPanelScheduleType Method
 Returns the panel schedule type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public PanelScheduleType GetPanelScheduleType()
Visual Basic
Public Function GetPanelScheduleType As PanelScheduleType
Visual C++
public:
PanelScheduleType GetPanelScheduleType()
See Also
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace